[{"title": "De-Mystifying IndieWeb on a WordPress Site", "src": "https://css-tricks.com/wp-content/uploads/2022/06/indieweb-wp-flow.jpg", "link": "https://css-tricks.com/de-mystifying-indieweb-on-a-wordpress-site/", "description": "Well, sheesh. I opened a little can of worms when sharing Miriam's “Am I on the IndieWeb yet?” with a short post bemoaning my own trouble getting on the IndieWeb train. But it's a good can of worms."}, {"title": "Useful Tools for Visualizing Databases on a Budget", "src": "https://css-tricks.com/wp-content/uploads/2022/06/dbviz-featured-image.jpg", "link": "https://css-tricks.com/useful-tools-for-visualizing-databases-on-a-budget/", "description": "A diagram is a graphical representation of information that depicts the structure, relationship, or operation of anything. Diagrams enable your audience to visually grasp hidden information and engage with them in ways that words alone cannot. Depending on the type ..."}, {"title": "Single Element Loaders: The Spinner", "src": "https://css-tricks.com/wp-content/uploads/2022/06/loaders-spinners.jpg", "link": "https://css-tricks.com/single-element-loaders-the-spinner/", "description": "Making CSS-only loaders is one of my favorite tasks. It's always satisfying to look at those infinite animations. And, of course, there are lots of techniques and approaches to make them - no need to look further than CodePen to ..."}, {"title": "Am I on the IndieWeb yet?", "src": "https://css-tricks.com/wp-content/uploads/2022/06/indieweb-puzzle.jpg", "link": "https://css-tricks.com/am-i-on-the-indieweb-yet/", "description": "Can't smash the Like button hard enough for what Miriam Suzanne has to say on the challenging technical hurdles of implementing Webmentions:"}, {"title": "Let's Make a QR Code Generator With a Serverless Function!", "src": "https://css-tricks.com/wp-content/uploads/2022/05/qr-code-pattern.jpg", "link": "https://css-tricks.com/lets-make-a-qr-code-generator-with-a-serverless-function/", "description": "QR codes are funny, right? We love them, then hate them, then love them again. Anyways, they've lately been popping up again and it got me thinking about how they're made. There are like a gazillion QR code generators out ..."}, {"title": "Building Interoperable Web Components That Even Work With React", "src": "https://css-tricks.com/wp-content/uploads/2022/06/interop-web-components.png", "link": "https://css-tricks.com/building-interoperable-web-components-react/", "description": "Those of us who've been web developers more than a few years have probably written code using more than one JavaScript framework. With all the choices out there - React, Svelte, Vue, Angular, Solid - it's all but inevitable. One ..."}, {"title": "Please Give Me Some Space", "src": "https://css-tricks.com/wp-content/uploads/2022/06/boxes-gap.jpg", "link": "https://css-tricks.com/please-give-me-some-space/", "description": "There's all kinds of ways to do that. Some more advisable and better-suited for certain situations than others, of course...."}, {"title": "How to Create Block Theme Patterns in WordPress 6.0", "src": "https://css-tricks.com/wp-content/uploads/2022/05/wp-patterns-featured-image.jpg", "link": "https://css-tricks.com/how-to-create-block-theme-patterns-in-wordpress-6-0/", "description": "Block patterns, also frequently referred to as sections, were introduced in WordPress 5.5 to allow users to build and share predefined block layouts in the pattern directory. The directory is the home of a wide range of ..."}, {"title": "SPAs, Shared Element Transitions, and Re-Evaluating Technology", "src": "https://css-tricks.com/wp-content/uploads/2019/10/native-web-app.png", "link": "https://css-tricks.com/spas-shared-element-transitions-and-re-evaluating-technology/", "description": "Nolan Lawson sparked some discussion when he described a noticeable shift away from single-page applications (SPAs):"}, {"title": "Just How Long Should Alt Text Be?", "src": "https://css-tricks.com/wp-content/uploads/2019/02/image-alt-attribute.png", "link": "https://css-tricks.com/just-how-long-should-alt-text-be/", "description": "I teach a class over at the local college here in Long Beach and a majority of the content is hosted on the Canvas LMS so students can access it online. And, naturally, I want the content to be as ..."}, {"title": "Beautify GitHub Profile", "src": "https://css-tricks.com/wp-content/uploads/2022/05/beautify-github-repo.jpg", "link": "https://css-tricks.com/beautify-github-profile/", "description": "It wasn't long ago that Nick Sypteras showed us how to make custom badges for a GitHub repo. Well, Reza Shakeri put Beautify GitHub Profile together and it's a huuuuuuge repo of different badges that pulls lots of examples ..."}, {"title": "Improving Icons for UI Elements with Typographic Alignment and Scale", "src": "https://css-tricks.com/wp-content/uploads/2022/05/align-icons-featured-image.jpg", "link": "https://css-tricks.com/improving-icons-for-ui-elements-with-typographic-alignment-and-scale/", "description": "Utilizing icons in user interface elements is helpful. In addition to element labeling, icons can help reinforce a user element's intention to users. But I have to say, I notice a bit of icon misalignment while browsing the web. Even ..."}, {"title": "How to Create Style Variations in WordPress 6.0 Block Themes", "src": "https://css-tricks.com/wp-content/uploads/2022/04/wirdpress-global-style-variations.jpg", "link": "https://css-tricks.com/creating-style-variations-in-wordpress-block-themes/", "description": "Global styles, a feature of the block themes, is one of my favorite parts of creating block themes. The concept of global style variations in WordPress were introduced in Gutenberg 12.5 which would allow theme authors to create alternate ..."}, {"title": "Cool Hover Effects That Use CSS Text Shadow", "src": "https://css-tricks.com/wp-content/uploads/2022/05/text-shadow.png", "link": "https://css-tricks.com/cool-hover-effects-that-use-css-text-shadow/", "description": "In my last article we saw how CSS background properties allow us to create cool hover effects. This time, we will focus on the CSS text-shadow property to explore even more interesting hovers. You are probably wondering how adding shadow ..."}, {"title": "A CSS Slinky in 3D? Challenge Accepted!", "src": "https://css-tricks.com/wp-content/uploads/2018/11/loops.png", "link": "https://css-tricks.com/a-css-slinky-in-3d/", "description": "Braydon Coyer recently launched a monthly CSS art challenge. He actually had reached out to me about donating a copy of my book Move Things with CSS to use as a prize for the winner of the challenge - ..."}, {"title": "COLRv1 and CSS font-palette: Web Typography Gets Colorful", "src": "https://css-tricks.com/wp-content/uploads/2022/05/s_07727771E2AE24CAE12B4C96FD6B6B6976797741459E0498D84303A46B2B3814_1644779893852_applehello.png", "link": "https://css-tricks.com/colrv1-and-css-font-palette-web-typography/", "description": "According to Toshi Omagari, the author of Arcade Game Typography, the world's first multi-colored digital font was created in 1982 for a never-released video game called Insector. Multi-colored fonts, sometimes called chromatic type, are still relatively rare on the ..."}, {"title": "Let's Create a Tiny Programming Language", "src": "https://css-tricks.com/wp-content/uploads/2022/05/magenta-code.jpg", "link": "https://css-tricks.com/lets-create-a-tiny-programming-language/", "description": "By now, you are probably familiar with one or more programming languages. But have you ever wondered how you could create your own programming language? And by that, I mean:"}, {"title": "Useful Tools for Creating AVIF Images", "src": "https://css-tricks.com/wp-content/uploads/2022/05/avif-logo.png", "link": "https://css-tricks.com/useful-tools-for-creating-avif-images/", "description": "AVIF (AV1 Image File Format) is a modern image file format specification for storing images that offer a much more significant file reduction when compared to other formats like JPG, JPEG, PNG, and WebP. Version 1.0.0 of the AVIF specification ..."}, {"title": "How to Serve a Subdomain as a Subdirectory", "src": "https://css-tricks.com/wp-content/uploads/2022/05/cloudflare-proxy.png", "link": "https://css-tricks.com/how-to-serve-a-subdomain-as-a-subdirectory/", "description": "Let's say you have a website built on a platform that excels at design and it's available at example.com. But that platform falls short at blogging. So you think to yourself, “What if I could use a different blogging ..."}, {"title": "Syntax Highlighting (and More!) With Prism on a Static Site", "src": "https://css-tricks.com/wp-content/uploads/2022/04/prism-next-syntax-highlighting.png", "link": "https://css-tricks.com/syntax-highlighting-prism-on-a-next-js-site/", "description": "So, you've decided to build a blog with Next.js. Like any dev blogger, you'd like to have code snippets in your posts that are formatted nicely with syntax highlighting. Perhaps you also want to display line numbers in the ..."}, {"title": "Adding Custom GitHub Badges to Your Repo", "src": "https://css-tricks.com/wp-content/uploads/2022/04/github-badges.png", "link": "https://css-tricks.com/adding-custom-github-badges-to-your-repo/", "description": "If you've spent time looking at open-source repos on GitHub, you've probably noticed that most of them use badges in their README files. Take the official React repository, for instance. There are GitHub badges all over the README file that communicate important dynamic info, like the latest released ..."}, {"title": "Creating Realistic Reflections With CSS", "src": "https://css-tricks.com/wp-content/uploads/2022/04/css-reflection.png", "link": "https://css-tricks.com/creating-realistic-reflections-with-css/", "description": "In design, reflections are stylized mirror images of objects. Even though they are not as popular as shadows, they have their moments - just think about the first time you explored the different font formats in MS Word or PowerPoint: ..."}, {"title": "grid-template", "src": "https://css-tricks.com/wp-content/uploads/2019/12/css-tricks-logo-gradient-outline.png", "link": "https://css-tricks.com/almanac/properties/g/grid-template/", "description": "The grid-template CSS property is a shorthand that allows you to define grid columns, rows, and areas in a CSS grid container with one declaration."}, {"title": "Cool CSS Hover Effects That Use Background Clipping, Masks, and 3D", "src": "https://css-tricks.com/wp-content/uploads/2022/05/Cool-hover-effects.jpg", "link": "https://css-tricks.com/css-hover-effects-background-masks-3d/", "description": "We've walked through a series of posts now about interesting approaches to CSS hover effects. We started with a bunch of examples that use CSS background properties, then moved on to the text-shadow property where we technically didn't use ..."}, {"title": "Customizing Color Fonts on the Web", "src": "https://css-tricks.com/wp-content/uploads/2022/05/palettes.png", "link": "https://css-tricks.com/customizing-color-fonts-on-the-web/", "description": "Myles C. Maxfield on the WebKit Blog published a nifty how-to for color fonts. It comes on the heels of what Ollie wrote up here on CSS-Tricks the other day, and while they cover a lot of common ..."}, {"title": "A Perfect Table of Contents With HTML + CSS", "src": "https://css-tricks.com/wp-content/uploads/2022/05/toc-photo-scaled.jpg", "link": "https://css-tricks.com/a-perfect-table-of-contents-with-html-css/", "description": "Earlier this year, I self-published an ebook called Understanding JavaScript Promises (free for download). Even though I didn't have any intention of turning it into a print book, enough people reached out inquiring about a print version that ..."}, {"title": "Mastering SVG's stroke-miterlimit Attribute", "src": "https://css-tricks.com/wp-content/uploads/2022/05/stroke-ventor-points-miter.png", "link": "https://css-tricks.com/mastering-svgs-stroke-miterlimit-attribute/", "description": "So, SVG has this stroke-miterlimit presentation attribute. You've probably seen it when exporting an SVG from a graphic editor program, or perhaps you find out you could remove it without noticing any change to the visual appearance."}, {"title": "First Look At The CSS object-view-box Property", "src": "https://css-tricks.com/wp-content/uploads/2019/11/images-all-around.png", "link": "https://css-tricks.com/first-look-at-the-css-object-view-box-property/", "description": "Ahmad Shadeed - doing what he always does so well - provides an early look at the object-view-box property, something he describes as a native way to crop an image in the browser with CSS."}, {"title": "Dialog Components: Go Native HTML or Roll Your Own?", "src": "https://css-tricks.com/wp-content/uploads/2018/10/dialog-featured.jpg", "link": "https://css-tricks.com/dialog-components-roll-your-own/", "description": "As the author of a library called AgnosticUI, I'm always on the lookout for new components. And recently, I decided to dig in and start work on a new dialog (aka modal) component. That's something many devs like to ..."}, {"title": "Verevolf", "src": "https://css-tricks.com/wp-content/uploads/2022/05/verevolf-site-bg.png", "link": "https://css-tricks.com/verevolf/", "description": "Zeldman:"}, {"title": "grid-template-areas", "src": "https://css-tricks.com/wp-content/uploads/2019/12/css-tricks-logo-gradient-outline.png", "link": "https://css-tricks.com/almanac/properties/g/grid-template-areas/", "description": "The grid-template-areas CSS property allows you to define and name the cells (or “areas”) in a CSS grid container."}, {"title": "Inline Image Previews with Sharp, BlurHash, and Lambda Functions", "src": "https://css-tricks.com/wp-content/uploads/2022/05/blurhash-featured-image.jpg", "link": "https://css-tricks.com/inline-image-previews-with-sharp-blurhash-and-lambda-functions/", "description": "Don't you hate it when you load a website or web app, some content displays and then some images load - causing content to shift around? That's called content reflow and can lead to an incredibly annoying user experience for ..."}, {"title": "An Interactive Starry Backdrop for Content", "src": "https://css-tricks.com/wp-content/uploads/2019/01/s_9DCA19C260A17186CB74D88060C4120D5C4E963F9CC68332AE102310C9807941_1547386667476_deepfield.jpg", "link": "https://css-tricks.com/an-interactive-starry-backdrop-for-content/", "description": "I was fortunate last year to get approached by Shawn Wang (swyx) about doing some work for Temporal. The idea was to cast my creative eye over what was on the site and come up with some ..."}]